---
kind: method
id: M:Autodesk.Revit.DB.DirectShapeType.GetOptions
source: html/9f0e48d9-9007-340b-51c6-5fefe3f5379b.htm
---
# Autodesk.Revit.DB.DirectShapeType.GetOptions Method

Gets a copy of the current options for this DirectShapeType.

## Syntax (C#)
```csharp
public DirectShapeTypeOptions GetOptions()
```

## Returns
Options currently set for this DirectShapeType.